### Homework 02: Quiz

In [81]:
import pandas as pd

#### Q2. friends_right = friends_s1.merge(friends_s2, how='right', left_on='character', right_on='character_name'); What's the shape of the output dataframe? *

In [82]:
friend_s1=pd.DataFrame()
friend_s1['character']='Rachel Green','Ross Geller','Phoebe Buffay','JoeyTribbiani','Monica Geller','Chandler Bing' 
friend_s1['name']='Jennifer Aniston','David Schwimmer','Lisa Kundrow', 'Matt LeBlanc','Courteney Cox','Matthew Perry'
friend_s1['birthday']='1969-02-11','1966-11-02','1963-07-30','1967-07-25','1964-06-15','1969-08-19'
display(friend_s1)

       character              name    birthday
0   Rachel Green  Jennifer Aniston  1969-02-11
1    Ross Geller   David Schwimmer  1966-11-02
2  Phoebe Buffay      Lisa Kundrow  1963-07-30
3  JoeyTribbiani      Matt LeBlanc  1967-07-25
4  Monica Geller     Courteney Cox  1964-06-15
5  Chandler Bing     Matthew Perry  1969-08-19

In [83]:
friend_s2=pd.DataFrame()
friend_s2['character_name']='Rachel Green','Ross Geller','Phoebe Buffay','JoeyTribbiani','Monica Geller','Chandler Bing','Richard Burke','Gunther','Emily Waltham','Mike Hannigan' 
friend_s2['gender']='female','male','female','male','female','male','male','male','female','male'
display(friend_s2)

  character_name  gender
0   Rachel Green  female
1    Ross Geller    male
2  Phoebe Buffay  female
3  JoeyTribbiani    male
4  Monica Geller  female
5  Chandler Bing    male
6  Richard Burke    male
7        Gunther    male
8  Emily Waltham  female
9  Mike Hannigan    male

In [84]:
df=pd.DataFrame({'Name':['A','B'],'Age':[29,32]})
display(df)
print(df.shape)

  Name  Age
0    A   29
1    B   32

(2, 2)

In [85]:
print('shape of data set 1 is = ', friend_s1.shape)
print('shape of data set 2 is = ', friend_s2.shape)

shape of data set 1 is =  (6, 3)
shape of data set 2 is =  (10, 2)

In [86]:
friends_right = friend_s1.merge(friend_s2, how='right', left_on='character', right_on='character_name')
display(friends_right)
print('What is the shape of the output dataframe?',friends_right.shape)

       character              name    birthday character_name  gender
0   Rachel Green  Jennifer Aniston  1969-02-11   Rachel Green  female
1    Ross Geller   David Schwimmer  1966-11-02    Ross Geller    male
2  Phoebe Buffay      Lisa Kundrow  1963-07-30  Phoebe Buffay  female
3  JoeyTribbiani      Matt LeBlanc  1967-07-25  JoeyTribbiani    male
4  Monica Geller     Courteney Cox  1964-06-15  Monica Geller  female
5  Chandler Bing     Matthew Perry  1969-08-19  Chandler Bing    male
6            NaN               NaN         NaN  Richard Burke    male
7            NaN               NaN         NaN        Gunther    male
8            NaN               NaN         NaN  Emily Waltham  female
9            NaN               NaN         NaN  Mike Hannigan    male

What is the shape of the output dataframe? (10, 5)

In [87]:
# friends_left = friend_s1.merge(friend_s2, how='left', left_on='character', right_on='character_name')
# display(friends_left)
# print('What is the shape of the output dataframe?',friends_left.shape)

#### friends_outer = friends_s1.merge(friends_s2, how='outer', left_on='character', right_on='character_name'); What's the shape of the output dataframe? *

In [88]:
friends_outer = friend_s1.merge(friend_s2, how='outer', left_on='character', right_on='character_name'); 
display(friends_outer)
print('What is the shape of the output dataframe?',friends_outer.shape)

       character              name    birthday character_name  gender
0   Rachel Green  Jennifer Aniston  1969-02-11   Rachel Green  female
1    Ross Geller   David Schwimmer  1966-11-02    Ross Geller    male
2  Phoebe Buffay      Lisa Kundrow  1963-07-30  Phoebe Buffay  female
3  JoeyTribbiani      Matt LeBlanc  1967-07-25  JoeyTribbiani    male
4  Monica Geller     Courteney Cox  1964-06-15  Monica Geller  female
5  Chandler Bing     Matthew Perry  1969-08-19  Chandler Bing    male
6            NaN               NaN         NaN  Richard Burke    male
7            NaN               NaN         NaN        Gunther    male
8            NaN               NaN         NaN  Emily Waltham  female
9            NaN               NaN         NaN  Mike Hannigan    male

What is the shape of the output dataframe? (10, 5)

### There two tables given for you. df_A has index Name, two columns Address and University, 3 rows. df_B has index name, one column Department, 3 rows. Perform inner join based on their index. how many missing values are present in the output dataframe? df_inner = df_A.merge(df_B, how='inner', left_index=True, right_index=True) *

In [89]:
df_A=pd.DataFrame({'Name':['Kawsar','Tasnim','Jakir'],'Address':['Houston','Boise','Tampa'],'University':['USF','BSU','USF']})
display(df_A)

     Name  Address University
0  Kawsar  Houston        USF
1  Tasnim    Boise        BSU
2   Jakir    Tampa        USF

In [90]:
df_B=pd.DataFrame({'Name':['Kawsar','Tasnim','Riad'],'Department':['EE','CS','EE']})
display(df_B)

     Name Department
0  Kawsar         EE
1  Tasnim         CS
2    Riad         EE

In [91]:
df_A.set_index('Name', drop=True, append=False, inplace=True)
display(df_A)

        Address University
Name
Kawsar  Houston        USF
Tasnim    Boise        BSU
Jakir     Tampa        USF

In [92]:
df_B.set_index('Name', drop=True, append=False, inplace=True)
display(df_B)

       Department
Name
Kawsar         EE
Tasnim         CS
Riad           EE

In [93]:
df_inner = df_A.merge(df_B, how='inner', left_index=True, right_index=True)
display(df_inner)
display(df_inner.shape)

        Address University Department
Name
Kawsar  Houston        USF         EE
Tasnim    Boise        BSU         CS

(2, 3)

In [94]:
display(df_inner)
# df_inner.info()
print('There is missing value? = ', pd.isnull('df_inner'))
# print(df_inner.isnull())

print('index of the output data frame df_inner', df_inner.index)
print('shape of the output data frame df_inner', df_inner.shape)

        Address University Department
Name
Kawsar  Houston        USF         EE
Tasnim    Boise        BSU         CS

There is missing value? =  False
index of the output data frame df_inner Index(['Kawsar', 'Tasnim'], dtype='object', name='Name')
shape of the output data frame df_inner (2, 3)

#### Missing values handling
https://www.geeksforgeeks.org/working-with-missing-data-in-pandas/

In [95]:
display(friends_right)
# friends_right.isnull()
# friends_right.isna()
# friends_right.info()
# friends_right.isnull().sum()
friends_right.isna().sum().sum()

       character              name    birthday character_name  gender
0   Rachel Green  Jennifer Aniston  1969-02-11   Rachel Green  female
1    Ross Geller   David Schwimmer  1966-11-02    Ross Geller    male
2  Phoebe Buffay      Lisa Kundrow  1963-07-30  Phoebe Buffay  female
3  JoeyTribbiani      Matt LeBlanc  1967-07-25  JoeyTribbiani    male
4  Monica Geller     Courteney Cox  1964-06-15  Monica Geller  female
5  Chandler Bing     Matthew Perry  1969-08-19  Chandler Bing    male
6            NaN               NaN         NaN  Richard Burke    male
7            NaN               NaN         NaN        Gunther    male
8            NaN               NaN         NaN  Emily Waltham  female
9            NaN               NaN         NaN  Mike Hannigan    male

12

#### friends_left = friends_s1.merge(friends_s2, how='left', left_on='character', right_on='character_name'); how many missing values are present in the output dataframe? *

In [96]:
# friends_left = friend_s1.merge(friend_s2, how='left', left_on='character', right_on='character_name')
# friends_left = friend_s1.merge(friend_s2, how='left', left_on='character', right_on='character_name')
# display(friends_left)
# friends_left.info()
print('how many missing values are present in the output dataframe? = ', friends_left.isna().sum().sum())

how many missing values are present in the output dataframe? =  0

In [97]:
# friends_left_b = friend_s1.merge(friend_s2, how='right', left_on='name', right_on='character_name')
# display(friends_left_b)
# display(friends_left)
# display(friends_right)

#### friends_inner = friends_s1.merge(friends_s2, how='inner', left_on='character', right_on='character_name'); What's the shape of the output dataframe? *

In [105]:
# friends_inner = friends_s1.merge(friends_s2, how='inner', left_on='character', right_on='character_name')
friends_inner = friend_s1.merge(friend_s2, how = 'inner', left_on = 'character', right_on = 'character_name')
friends_left = friend_s1.merge(friend_s2, how = 'left', left_on='character', right_on = 'character_name')
# display(friends_left)
# display(friends_inner)
print('What is the shape of the output dataframe:friends_inner? = ', friends_inner.shape)
print('What is the shape of the output dataframe:friends_left? = ', friends_left.shape)

What is the shape of the output dataframe:friends_inner? =  (6, 5)
What is the shape of the output dataframe:friends_left? =  (6, 5)